Autodesk.Revit.DB.StorageType
An enumerated type listing all of the internal parameter data storage types that Autodesk Revit supports.

Autodesk.Revit.DB.StorageType.ElementId
The data type represents an element and is stored as the id of the element.

Autodesk.Revit.DB.StorageType.String
The internal data will be stored in the form of a string of characters.

Autodesk.Revit.DB.StorageType.Double
The data will be stored internally in the form of an 8 byte floating point number.

Autodesk.Revit.DB.StorageType.Integer
The internal data is stored in the form of a signed 32 bit integer.

Autodesk.Revit.DB.StorageType.None
None represents an invalid storage type. This value should not be used.